YCSB/BenchmarkResults/ThroughputLatencyAndReplicas/GRACE/5.txt
/usr/bin/java  -classpath /home/ayush/work/YCSB/conf:/home/ayush/work/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ayush/work/YCSB/grace/target/grace-binding-0.18.0-SNAPSHOT.jar:/home/ayush/work/YCSB/grace/target/dependency/HdrHistogram-2.1.12.jar:/home/ayush/work/YCSB/grace/target/dependency/antlr4-runtime-4.9.1.jar:/home/ayush/work/YCSB/grace/target/dependency/caffeine-2.3.1.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-beanutils-1.9.4.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-collections-3.2.2.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-configuration2-2.8.0.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-lang3-3.12.0.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-logging-1.2.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-text-1.10.0.jar:/home/ayush/work/YCSB/grace/target/dependency/error_prone_annotations-2.11.0.jar:/home/ayush/work/YCSB/grace/target/dependency/exp4j-0.4.8.jar:/home/ayush/work/YCSB/grace/target/dependency/failureaccess-1.0.1.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-core-3.6.2.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-driver-3.7.0.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-groovy-3.6.2.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-language-3.6.2.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-shaded-3.6.2.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-util-3.7.0.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-2.5.15-indy.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-cli-picocli-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-console-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-groovysh-2.5.15-indy.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-json-2.5.15-indy.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-jsr223-2.5.15-indy.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-swing-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-templates-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-xml-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/guava-31.1-jre.jar:/home/ayush/work/YCSB/grace/target/dependency/hppc-0.7.1.jar:/home/ayush/work/YCSB/grace/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ayush/work/YCSB/grace/target/dependency/ivy-2.5.1.jar:/home/ayush/work/YCSB/grace/target/dependency/j2objc-annotations-1.3.jar:/home/ayush/work/YCSB/grace/target/dependency/janusgraph-driver-1.0.0-rc2.jar:/home/ayush/work/YCSB/grace/target/dependency/javatuples-1.2.jar:/home/ayush/work/YCSB/grace/target/dependency/jbcrypt-0.4.jar:/home/ayush/work/YCSB/grace/target/dependency/jcabi-log-0.20.0.jar:/home/ayush/work/YCSB/grace/target/dependency/jcabi-manifests-1.2.1.jar:/home/ayush/work/YCSB/grace/target/dependency/jcl-over-slf4j-1.7.25.jar:/home/ayush/work/YCSB/grace/target/dependency/jline-2.14.6.jar:/home/ayush/work/YCSB/grace/target/dependency/jsr305-3.0.2.jar:/home/ayush/work/YCSB/grace/target/dependency/jts-core-1.17.0.jar:/home/ayush/work/YCSB/grace/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/home/ayush/work/YCSB/grace/target/dependency/neo4j-java-driver-4.4.3.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-all-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-buffer-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-dns-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-haproxy-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-http-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-http2-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-memcache-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-mqtt-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-redis-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-smtp-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-socks-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-stomp-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-xml-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-common-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-handler-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-handler-proxy-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-handler-ssl-ocsp-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-dns-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-dns-classes-macos-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-aarch_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-x86_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-classes-epoll-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-classes-kqueue-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-aarch_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-x86_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-aarch_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-x86_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-unix-common-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-rxtx-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-sctp-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-udt-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/noggit-0.8.jar:/home/ayush/work/YCSB/grace/target/dependency/picocli-4.3.2.jar:/home/ayush/work/YCSB/grace/target/dependency/reactive-streams-1.0.3.jar:/home/ayush/work/YCSB/grace/target/dependency/slf4j-api-1.7.25.jar:/home/ayush/work/YCSB/grace/target/dependency/snakeyaml-1.32.jar:/home/ayush/work/YCSB/grace/target/dependency/spatial4j-0.8.jar site.ycsb.Client -t -db site.ycsb.db.GraceClient -P workloads/workload_grace -p HOSTURI=http://localhost:3000 -p maxexecutiontime=60 -p threadcount=1
Data integrity is enabled.
GraceClient  Created
Starting GRACE client
{deleteproportion=1, recordcount=100000, operationcount=2000000, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, DBTYPE=neo4j, updateproportion=1, HOSTURI=http://localhost:3000, dotransactions=true, createproportion=1, DBURI=bolt://localhost:7687, maxexecutiontime=60, readallfields=true, db=site.ycsb.db.GraceClient, requestdistribution=latest}
GRACE HOSTURI: http://localhost:3000
DBTYPE: neo4j
DBURI: bolt://localhost:7687
[OVERALL], RunTime(ms), 60005
[OVERALL], Throughput(ops/sec), 202.93308890925755
[TOTAL_GCS_G1_Young_Generation], Count, 5
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 78
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.12998916756936924
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 78
[TOTAL_GC_TIME_%], Time(%), 0.12998916756936924
[REMOVE_VERTEX], Operations, 850
[REMOVE_VERTEX], AverageLatency(us), 3214.4023529411766
[REMOVE_VERTEX], MinLatency(us), 1775
[REMOVE_VERTEX], MaxLatency(us), 17935
[REMOVE_VERTEX], 50thPercentileLatency(us), 2951
[REMOVE_VERTEX], 95thPercentileLatency(us), 4727
[REMOVE_VERTEX], 99thPercentileLatency(us), 7471
[REMOVE_VERTEX], Return=OK, 850
[GET_EDGE_WITH_PROPERTY], Operations, 841
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 3657.3317479191437
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 1690
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 84415
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 3429
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 4747
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 8263
[GET_EDGE_WITH_PROPERTY], Return=OK, 841
[ADD_EDGE], Operations, 904
[ADD_EDGE], AverageLatency(us), 14808.035398230088
[ADD_EDGE], MinLatency(us), 2112
[ADD_EDGE], MaxLatency(us), 93183
[ADD_EDGE], 50thPercentileLatency(us), 7907
[ADD_EDGE], 95thPercentileLatency(us), 53887
[ADD_EDGE], 99thPercentileLatency(us), 56991
[ADD_EDGE], Return=OK, 904
[ADD_VERTEX], Operations, 826
[ADD_VERTEX], AverageLatency(us), 5871.567796610169
[ADD_VERTEX], MinLatency(us), 1807
[ADD_VERTEX], MaxLatency(us), 118207
[ADD_VERTEX], 50thPercentileLatency(us), 6231
[ADD_VERTEX], 95thPercentileLatency(us), 10087
[ADD_VERTEX], 99thPercentileLatency(us), 15551
[ADD_VERTEX], Return=OK, 826
[GET_VERTEX_WITH_PROPERTY], Operations, 855
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 3284.743859649123
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 1619
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 51359
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 3131
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 4899
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 7191
[GET_VERTEX_WITH_PROPERTY], Return=OK, 855
[REMOVE_EDGE_PROPERTY], Operations, 891
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 5947.171717171717
[REMOVE_EDGE_PROPERTY], MinLatency(us), 1883
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 22095
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 3601
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 11279
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 13015
[REMOVE_EDGE_PROPERTY], Return=OK, 891
[REMOVE_EDGE], Operations, 872
[REMOVE_EDGE], AverageLatency(us), 3184.5573394495414
[REMOVE_EDGE], MinLatency(us), 1800
[REMOVE_EDGE], MaxLatency(us), 17903
[REMOVE_EDGE], 50thPercentileLatency(us), 2981
[REMOVE_EDGE], 95thPercentileLatency(us), 4623
[REMOVE_EDGE], 99thPercentileLatency(us), 6643
[REMOVE_EDGE], Return=OK, 872
[GET_EDGE_LABELS], Operations, 854
[GET_EDGE_LABELS], AverageLatency(us), 3473.154566744731
[GET_EDGE_LABELS], MinLatency(us), 1736
[GET_EDGE_LABELS], MaxLatency(us), 18895
[GET_EDGE_LABELS], 50thPercentileLatency(us), 3369
[GET_EDGE_LABELS], 95thPercentileLatency(us), 4959
[GET_EDGE_LABELS], 99thPercentileLatency(us), 7575
[GET_EDGE_LABELS], Return=OK, 854
[REMOVE_VERTEX_PROPERTY], Operations, 867
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 4277.2087658592845
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 1831
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 12247
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 3411
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 6939
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 9687
[REMOVE_VERTEX_PROPERTY], Return=OK, 867
[GET_VERTEX_COUNT], Operations, 844
[GET_VERTEX_COUNT], AverageLatency(us), 2849.9940758293837
[GET_VERTEX_COUNT], MinLatency(us), 1461
[GET_VERTEX_COUNT], MaxLatency(us), 34303
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 2765
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 4575
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 7063
[GET_VERTEX_COUNT], Return=OK, 844
[GET_EDGES_WITH_LABEL], Operations, 909
[GET_EDGES_WITH_LABEL], AverageLatency(us), 2889.1408140814083
[GET_EDGES_WITH_LABEL], MinLatency(us), 1303
[GET_EDGES_WITH_LABEL], MaxLatency(us), 16591
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 2827
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 4915
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 7103
[GET_EDGES_WITH_LABEL], Return=OK, 909
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4.0
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 50thPercentileLatency(us), 4
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 4
[SET_EDGE_PROPERTY], Operations, 868
[SET_EDGE_PROPERTY], AverageLatency(us), 5884.97465437788
[SET_EDGE_PROPERTY], MinLatency(us), 1924
[SET_EDGE_PROPERTY], MaxLatency(us), 19327
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 3587
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 11199
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 13295
[SET_EDGE_PROPERTY], Return=OK, 868
[SET_VERTEX_PROPERTY], Operations, 907
[SET_VERTEX_PROPERTY], AverageLatency(us), 4653.589856670342
[SET_VERTEX_PROPERTY], MinLatency(us), 1947
[SET_VERTEX_PROPERTY], MaxLatency(us), 160639
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 3757
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 7599
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 10135
[SET_VERTEX_PROPERTY], Return=OK, 907
[GET_EDGE_COUNT], Operations, 889
[GET_EDGE_COUNT], AverageLatency(us), 3115.048368953881
[GET_EDGE_COUNT], MinLatency(us), 1516
[GET_EDGE_COUNT], MaxLatency(us), 23823
[GET_EDGE_COUNT], 50thPercentileLatency(us), 3031
[GET_EDGE_COUNT], 95thPercentileLatency(us), 4875
[GET_EDGE_COUNT], 99thPercentileLatency(us), 7611
[GET_EDGE_COUNT], Return=OK, 889